Repository: atlas-studios/Session2-G2
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 望着堆满整个房间的药草，江逸无奈的退了出来，走进偏厅内想询问一下柳长老怎么区分药草，却看到柳长老正全神贯注的配置药粉，他进来站了好一会都没看他一眼……
en_us: Looking at the room full of medicinal herbs, Jiang Yi helplessly retreated. He walked into the side room, wishing to ask Elder Liu how one could differentiate between the various medicinal herbs. However, he saw Elder Liu deeply engrossed in configuring the medicinal ingredients, to the point that he did not even notice Jiang Yi despite having entered and stood there for quite a long time...

source: 望着如一条爬虫般瘫软在地的江如虎，江逸眼中闪过一丝快意，在江家被这群人欺辱了这么多年，今日终于算是拿回来一些利息了。
en_us: Observing Jiang Ruhu, who was lying limply on the ground like a crawling insect, a sensed of elation flashed in Jiang Yi's eyes. Having been bullied by this bunch of people from the Jiang Clan for so many years, he could finally claim to have earned some interest back that day.

source: 望着满脸从容，悠然转身朝丹房内走去的江逸，江如虎满眸迷茫起来。这还是以前那个经常被他们打得和狗一样的废物吗？怎么刚才那一瞬间给他感觉，江逸的气度比起江恨水还要有过之而无不及？
en_us: Seeing Jiang Yi's face filled with calm as he unhurriedly turned around to walk back in the direction of the alchemy lab, Jiang Ruhu was completely bewildered. Was this the good-for-nothing that they usually beat up like a dog in the past? How could it be possible that that passing moment gave him a feeling that Jiang Yi's presence felt bigger than even that of Jiang Henshui?

source: 未等沈萤问，他接着就主动解释道，“我轩辕家素来倍出丹修，整个三青界怕是找不出比我族更强的丹修，家主更是十阶的练丹师。道友所获那只千叶草木灵乃是练丹圣物，且只对丹修有用，对于其它修士来说是没有任何用处的。我看道友并不是丹修，何不将其让与我轩辕家，物尽其用。”
en_us: Before waiting for Shen Ying to ask, he continued, "My Xuan Yuan Family has always worked hard to refine pills and elixirs. I don't think you would be able to find another family of alchemists as powerful as mine in any of the Three Realms. Our family's master is a tenth-level alchemist as well. The Thousand Leaves Vegetation Spirit that you, my fellow Daoists, have obtained is a beast useful only for refining pills and elixirs. It has absolutely no value in any other area. You two don't look like alchemists to me. Why don't you hand the Thousand Leaves Vegetation Spirit over to my Xuan Yuan Family to put it to good use?"

source: 本命武器与他元神相连，青岚张口吐出一口血。
en_us: The intrinsic weapon was closely linked to his primordial spirit. Blood spurted out of Qing Lan's mouth.

source: 本来散修向来散漫，三教九流什么人都有，且大多不是转为魔修，就是专干些偷鸡摸狗，杀人夺宝的事。就他像是散修界的一股清流，为人钢铁般的正直，只要是犯在他手里的恶人，绝讨不了好。偏偏他又是名剑修，本来就比同阶要强上一节，传闻金丹以下的魔修，都被他揍过。他所经之地，很少有魔修出来犯事。
en_us: Itinerant cultivators had always been a disorganized lot, made up of all manner of people. Most of them either switched to become fiendish cultivators or turned to pilfering, killing and robbery. He was like a breath of fresh air in the world of itinerant cultivators and he had ironclad integrity. Any wicked creature who fell into his hands came to no good end. As if that were not enough, he was also a famous sword cultivator who was one level higher than his peers. It was rumored that fiendish cultivators below the level of Golden Core had all been thrashed by him. Very few fiendish cultivators committed crimes in places he had passed through.

source: 本来这告示一出来，绝对会有很多人找江逸对练的，但江逸既然开口了，杨管事还指望他赚钱，也不好拂他的面子，从怀中取出一块令牌递给江逸道：“在武殿内学习武技本是要紫金的，不过你现在是紫金陪练，我可以给你个特权，你去藏书阁找白管事，任意学习三种人阶武技，这是我的令牌。给你五天假期，五天之后你必须上场陪练。”
en_us: Originally, with the release of this announcement, there would definitely be a lot of people who would seek Jiang Yi for sparring practice. However, since Jiang Yi had opened his mouth, while Manager Yang still counted on him to make money and knew that it was not good to brush him aside or make him lose face, Manager Yangdecided to retrieve a token from his breast-pocket and passed it to Jiang Yi. Manager Yang said, "To train one's martial arts techniques in the Martial Arts Hall, one should start off with paying purple gold. However, since you're a purple gold token-grade sparring partner now, I can grant you a certain special privilege. You can go to the Book Storage Pavilion and search for Manager Bai, and learn any three human-grade martial arts techniques, chosen at your own will. This is my command token. I'll let you take five days of leave, but after five days, you must go into the combat training field and conduct sparring practice."

source: 本着同伴的友谊，他提醒了一句，“神兽是不会轻易受人驱使的。”
en_us: Yi Feng gave her a friendly warning, "Divine beasts aren't easily controlled by humans."

source: 杀气！好浓厚的杀气！羿清忍不住抖了一下，为啥他突然觉得师父的样子……有点可怕？！
en_us: A killing vibe! What an intense killing vibe! Yi Qing could not help shuddering. Why did he suddenly feel that the Master looked…a little scary?!

source: 束魂咒是直接下在魂体上的一种咒术，中术者无论在何处，只要咒术一发动，施术者就能瞬间出现在对方的身边，只是这种咒术对中术人的损者极大。
en_us: The Soul Binding Spell was a spell cast directly on the soul. No matter where its castee was, as long as the spell was activated, the spell caster would be able to instantly appear at his side. The only thing was, this spell was greatly detrimental to the castee.

source: 来人是一个穿着火红色武士袍的少女，一脸扯高气昂，姿色算是中等，比起姬听雨还差一个档次，不过因为穿着紧身武士袍，将凹凸有致的身材完全显露出来，很是惹火。
en_us: Just as he thought of posing a few queries regarding the rules, the sound of footsteps rang from the corridor behind him. The manager immediately cast him away and sent him off with a smile. The person who arrived was a teenage girl dressed in fiery-red martial artist robes. With an arrogant look on her face and moderately good looks, she was a level lower compared to Ji Tingyu. However, as she wearing body-hugging martial artist robes that made the shapely contours of her figure visible, she was attractive.

source: 来人：“……”
en_us: The person: "..."

source: 来到武殿已经整整一个月了，江逸除了修炼外都是破解封印符文。封印符文破解的速度很快，修炼的进展也很快，按他估计差不多还要一个半月，他就能达到铸鼎境四重了。
en_us: It had been a month since Jiang Yi came to the Martial Arts Hall. Besides cultivating, he spent all his energy on breaking the runic patterns on the seal. The progress for both was fast. By his estimation, it would only take approximately another month and half for him to reach the fourth stage of the Cast Tripod Realm.

source: 杨管事一张老脸上都是不解和困惑，他看了画面很久还是惊疑不定，最终朝白发老者拱手道：“费老，您怎么看？”
en_us: Manager Yang's elderly face revealed a look of non-comprehension and confusion. He stared at the images for a very long time, but remained completely bewildered. Finally, he raised his hands in surrender towards the elderly man with white hair and said, "Elder Fei, what do you make of this?"

source: 杨管事一挥手让护卫下去，这才笑容可掬的和江逸说道：“苍狼，我也不瞒你，开门见山的说了，我代表武殿想和你做一笔交易。”
en_us: Manager Yang waved his hands to send away the guard. It was only then that, beaming from ear to ear, he addressed Jiang Yi by saying, "Lone Wolf, I don't want to beat around the bush, so I will say this to you directly that, on behalf of the Martial Arts Hall, I would like to make a deal with you."

source: 杨管事也是一愣，三位公子看到江逸带着铜牌面具更是满眸错愕，姬小姐铸鼎境八重和一个小小的铜牌陪练对战什么？一根手指头怕是就能戳死江逸吧？
en_us: Manager Yang similarly stared at her blankly, while the three gentlemen stared at Jiang Yi, who was wearing a bronze mask, with much astonishment in their eyes. How could Young Mistress Ji, with a power level at the eighth stage of the Cast Tripod Realm, possibly choose to fight with a little bronze token-grade sparring partner? Would her finger alone not be able to stab Jiang Yi to death?

source: 杨管事傻眼了，看着江逸也一副见鬼了的表情。这铸鼎境一重武者怎么可能是金牌陪练？要是人人都是金牌陪练，武殿也不用如此急迫的招人了……
en_us: Manager Yang was flabbergasted. He looked at Jiang Yi as though he had seen a ghost. How could this martial artist at the first stage of the Cast Tripod Realm be a gold-token-grade sparring partner? If everyone was a gold-token-grade sparring partner, then the Martial Arts Hall would not be so desperately hiring new staff...

source: 杨管事哑然失笑，解释道：“苍狼，你只是受聘于武殿，你并不是武殿的人，换句话说你是在做工，我们付工钱。武殿内其余的几名金牌陪练也和我们有交易的，苍狼啊……你别把事情想得那么复杂，实话和你说吧，我就看重你变态的战斗本能，反应速度，准备培养你一番，让你成为顶级的金牌陪练，这样你能替武殿赚钱，就这么简单！”
en_us: Manager Yang laughed involuntarily and explained, "Lone Wolf, you're only being hired by the Martial Arts Hall. You're not one of the men of the Martial Arts Hall. In other words, you have a paid job, and we provide you the salary. The few other gold token-grade sparring partners in the Martial Arts Hall have also signed contractual deals with us. Lone Wolf... don't think about things in such a complicated manner. To tell you the truth, I take great interest and importance in your obscenely powerful natural ability in combat and reaction speed, and am ready to invest resources and nurture your skills, so that you can become a top-quality golden token-grade sparring partner. In this way, you can help the Martial Arts Hall make money. It's just that simple a situation!"

source: 杨管事在听说江逸准备在武殿内闭关三月哪也不去，不仅没有半点不满，反而大方的免了江逸的食宿费。江逸能在这全力修炼，尽早提升到铸鼎境四重，武殿内就能快速增加一位金牌陪练，也能为他们赚取更多的银钱。要知道在这武殿内和陪练对战，金牌陪练那可是按每场收费的……
en_us: Manager Yang was not displeased at Jiang Yi's intention to go into seclusion at the Martial Arts Hall for three months. Rather, he generously waived Jiang Yi's boarding expenses. Jiang Yi was able to concentrate all his energy into cultivation to elevate his powers to the fourth stage of the Cast Tripod Realm. In doing so, the Martial Arts Hall would then acquire a gold token-grade sparring partner, who charged by each match...

source: 杨管事坐了一小会，和门口的一名护卫吩咐道。护卫匆忙朝练功房方向走去，很快就把满眸疑惑的江逸带了进来。
en_us: Chief Yang sat down for a short while as he instructed a guard standing at the door. That guard hastily walked in the direction of the Technique Practising Room and very quickly brought Jiang Yi, with his eyes revealing emotions of confusion and doubt, into the room.

source: 杨管事大笑，傲然说道：“不需要那东西，武殿不会违约，也从不怕……别人违约！行了，这瓶丹药你先拿着，你去大殿内修炼吧。这几天不到万不得已的情况，我不会让你上场的，你现在主要的任务就是修炼，尽快提升到铸鼎境四重。”
en_us: Manager Yang laughed loudly and proudly replied, "There's no need for that kind of thing. The Martial Arts Hall will never breach a contract, and has never been afraid... that someone else would breach a contract either! That's settled then. You hold on to this elixir bottle first. Head over to the interior of the Great Hall and cultivate your power. For these next few days, unless as an absolute last resort, I will not send you out for a sparring match. Your main task right now would be to cultivate your power and increase its level to the fourth stage of the Cast Tripod Realm as soon as possible."

source: 杨管事头疼的望着一群全部伤痕累累的陪练，又四处一扫其余练功房，看到没有一名白银陪练走出，只能无奈指着江逸道：“苍狼，出战。”
en_us: Nursing a headache, Manager Yang looked at the group of sparring partners, all of them riddled with injuries, before giving the rest of the technique-practicing rooms a sweeping glance. Seeing as none of the silver-token-grade sparring partners had left their rooms, he could only helplessly point at Jiang Yi and order, "Lone Wolf, you're up for combat."

source: 杨管事急了，这好不容易招到一个好陪练，他怎么能眼睁睁看着江逸走？这几日他可是被这群公子小姐催得头顶冒烟了。连忙凑过来和江逸笑眯眯的说道：“苍狼，你是不是嫌弃钱少了？这样……你继续在这呆着，我给你按银牌陪练的钱算？十两银子一天，如何？”
en_us: Manager Yang was flustered. He had finally managed to hire a good sparring partner after so much difficulty. How could he allow himself to look on helplessly and allow Jiang Yi to leave willy-nilly? After all, he had been so hard-pressed by the demands of that group of young masters and young mistresses over the past few days that he was frustrated and fuming with rage. Hurriedly moving closer to Jiang Yi and beaming at him, Manager Yang said, "Lone Wolf, is it just that you simply dislike how low the pay is? In that case... you continue staying here, and I'll pay you the rate for a silver token-grade sparring partner? Ten taels of silver a day, how about that?

source: 杨管事想不通，不过他知道如果下次江逸还来陪练，一定得想方设法留住他。如果他的确能帮助武殿内的公子小姐们武技快速大成，那么他的价值就不可估量了……
en_us: Manager Yang could not understand any of it. However, he knew that the next time Jiang Yi should ever return as a sparring partner, he had to find some way to make him stay. If he could indeed help the young masters and young mistresses in the Martial Arts Hall achieving phenomenal success in speeding up the improvements of their martial arts skills proficiency, then his value would be virtuely incalculable...

source: 杨管事敞开来说了，江逸反而内心安定，他沉思了一会，最终眼中露出一丝狠色，咬牙道：“在这干五年可以，不过我有两个要求。”
en_us: With Manager Yang's full disclosure of his intentions, Jiang Yi on the other hand became more calm in his heart. He thought deeply for a while, before finally revealing a look of ruthlessness in his eyes. He gritted his teeth and responded, "I don't have a problem with working here for five years, but I have two requests."

source: 杨管事淡淡一笑道：“很简单，你这算违约，按规矩要赔付百倍财物，我算了下差不多你要赔偿武殿一万两紫金，当然……如果你死了，这合约就自动解除。”
en_us: With faint smile, Manager Yang replied, "Very simple - this is considered a breach of contract. According to the rules stipulated, you would have to repay a hundred times worth in valuables. According to my calculation, you would owe the Martial Arts Hall almost ten thousand taels of purple gold. Of course... if you die, this contract will automatically be cancelled."

source: 杨管事疑惑地眨了眨眼睛，询问道：“怎么了？翊小姐，那个陪练有问题？”
en_us: Puzzled, Manager Yang blinked his eyes and inquired, "What's the matter? Young Mistress Yi, was there a problem with that sparring partner?"

source: 杨管事的确不在练功房，而是在附近的一个小房间内，他不是一个人，小房间内还有一个衣袍华贵的白发老者，两人正聚精会神的观看着墙壁上的一幅画面。
en_us: Manager Yang was indeed not in the Technique Practising Room, but rather in a small room nearby. He was not alone - there was an elderly man with white hair and elegant robes in the small room as well. The two men were attentively observing a painting on the wall.

source: 杨管事笑着起身，点头道：“没问题，不过你必须在这干满十天之后，我才能给你预支，另外还有问题吗？没有的话，祝我们合作愉快！”
en_us: Manager Yang smiled as he stood up, before nodding and responding, "No problem, but you must work for ten full days here. Only then will I give you an advance on your pay. Are there any other questions? If not, I hope we have a good working partnership and business collaboration!"

source: 杨管事脸色顿时变了，满眸都是悔意。这练功房对练，主要目的就是训练反应速度，战斗本能，还有磨砺武技。这三项都很难提升，需要长时间的对战和磨练，这也是练功房内封印元力的原因。
en_us: Manager Yang's facial expression suddenly changed, as his pupils became filled with remorse. The main purpose of conducting sparring practice at this Technique Practising Room was to facilitate the training of a person's reaction speed and combat instincts as well as improve a person's martial arts skills. It was very difficult to improve these three aspects, requiring a long time of combat practice and honing of skills. This was also the reason why the Technique Practising Room sealed off the use of essence force.

source: 杨管事连忙把江逸原先戴的苍狼面具给江逸，朝旁边的一个下人打了个眼色，那人立即匆匆离去。
en_us: Manager Yang hurriedly passed to Jiang Yi the wolf mask he was originally wearing, before giving a visual signal to a servant standing next to him. That servant immediately left in a hurry.

source: 杨管事连忙拱手俯身，等费老离去后，他才快步走到墙壁边上，一只手元力环绕按在一块石砖上，那墙壁上的画面神奇的消失了，又变成一面雪白的石墙。
en_us: Manager Yang promptly cupped his hands in greeting and bowed in sending Elder Fei off. It was only once Elder Fei had left that he walked with a quick pace to one of the walls. Using one of his hands, which had essence force revolving around it, to press on a stone brick, the image being broadcast on the wall magically vanished, becoming a snow-white stone wall face once again.

source: 杨管事随意一摆手道：“你说吧，只要不过分都好说。”
en_us: Manager Yang nonchalantly waved his hands and replied, "Say it, it's all negotiable so long as it isn't too excessive or demanding."

source: 杨管事颔首道：“没错，武殿会在两个月内全力培养你达到铸鼎境四重，你则必须在这当陪练五年，当然……武殿会根据你的实力，给予相对应的薪水，比如你实力是银牌陪练时，一天十两银子，实力达到金牌陪练时，一天一两紫金。”
en_us: Manager Yang nodded his head and replied, "That's right. The Martial Arts Hall will spare no expense in nurturing you over the next two months such that your power level reaches the fourth stage of the Cast Tripod Realm. In exchange, you must be a sparring partner here for five years. Of course... The Martial Arts Hall will, based on your power, give you the corresponding salary. For instance, when your power is on par with that of a silver token-grade sparring partner, the rate is ten taels of silver per day; when your power is on par with that of a gold token-grade sparring partner, the rate will be a tael of purple gold per day."

source: 林深树密的，她根本分不出哪些可以吃，哪些吃不了。到是小动物挺多的，个个都有点营养过盛，总是比普通的要大只一些，而且她还发现，这些小动物居然会说话。
en_us: Within the depths of the forest, she could not differentiate what was edible and what was not. There were quite a lot of small animals and they seemed to have a little too much nutrition as they were larger than usual. Moreover, she realized that those small animals could actually talk.

source: 果然……
en_us: True enough...

source: 果然……他是在作梦吧？
en_us: Was he... dreaming/

source: 果然……还是记不住名字！
en_us: Indeed… she was still not able to remember names!

source: 果然下一刻，轰隆一声雷响，白色的闪电撕开云层直劈而下，狠狠的打在下面的树木茧上，瞬间烧焦大半层。雷却没有停下，反而一道接一道，越劈越重。不到半刻的功夫，那个密不透风的木茧已经被劈得七零八落，中间一片尘土飞扬，看不清萝卜的样子，只是空气中隐隐传来焦糊味。
en_us: In the next moment, there was a loud crack of thunder and a streak of lightning lit up the sky, striking the plants beneath it. Half of the forest seemed to have been burnt by that lightning strike. Yet bolts of lightning still continued to fall, streak after streak, each one more poweful than the last. Only several seconds had passed before they realized that the dome of plants had mostly been struck down. A cloud of dust continued to hide the radish's body from sight and the air was filled with a burnt smell.

source: 果然只见场中已经清场完毕，一绿一蓝两个身影顿时出现在了场中。绿衣的正是思羽，对面是一名金丹大满圆修士，而且看他身上的气息，已经有了半步元婴的趋势了。
en_us: Indeed, the stage was clear. The contestants, one green-clothed and one blue-clothed, stepped onto the stage. The one in green was Si Yu, and the person opposite from her was a Perfected Golden Core cultivator. From his aura, he looked like he was halfway to advancing to the Nascent Soul stage.

source: 果然四周突然就暗了下来，无敌派的上空，风起云涌，雷云汇聚，隐隐还有紫色的电光透出。
en_us: True enough, the surrounding became dark all of a sudden. Gusts of winds blew, dark clouds, from which a faint purple streak of lightning could be seen, formed in the upper atmosphere of the Invincible Sect.

source: 果然当他们踏上最后一阶台阶，四周的景象再次变了，成了一片一眼看不到头的荒原。他们放开神识也探不到边界，就像突然生出一个空间一样。
en_us: As they stepped up the last step, their surroundings changed once again. They were now in an extremely vast wasteland. Even with their Divine Perception, they couldn't perceive the boundaries of this wasteland. It was just as if they stepped out of another dimension.

source: 果然烹饪是门高深的学问。
en_us: Clearly, the culinary arts is a profound field of knowledge.

source: 果然这火海一出现，羿清周身的灵剑瞬间化为灰烬，开始反扑了回去。羿清立马改变剑招，召回万千灵剑，在周身形成一道剑墙，顺时针旋转起来，利用形成的剑气驱逐火焰。但却并不能阻止火焰向他靠近。
en_us: As soon as the sea of fire appeared, the spirit swords surrounding Yi Qing disintegrated into ashes and scattered. Yi Qing immediately changed his strategy and recalled tens of thousands of his spirit swords. They surrounded him, forming a wall of swords which revolved around him. He tried to use the wall of swords to put out the flames, but he couldn't stop the flames from getting closer to him.

source: 果然里面的声音越来越大了，相较之前几不可闻，现在那声音已经大得有些刺耳了。满个大殿都是那幡内鬼王，声情并茂，酣畅淋漓，放飞自我的：嘤嘤嘤嘤嘤嘤嘤……
en_us: The sound coming out from the gonfalon was indeed getting louder; compared to the previous sounds that were almost indistinguishable, now it was already so loud that it was jarring. The entire hall was filled with the sounds of the Ghost King from within the gonfalon. It cried out with deep emotions to its heart content, letting itself loose: Waawaawaawaawaawaawaa…

source: 果然！
en_us: Sure enough!

source: 果然，下一刻原本焦黑的地面，像是回春一样，瞬间化出大片的绿色，半息之间满地的鲜花盛放，姹紫嫣红的开了一大片。
en_us: Indeed, the next moment, the once black land where the radish stood turned back to green just like in springtime. A moment later, flowers began to bloom from the grass which had sprouted, the ground becoming covered in red and purple.

source: 果然，不到半刻钟的功夫，一个修士唤出满天剑雨，朝着众人唰啦啦的戳了下来。看着后面不堪一击的众人，他不得不撤了回去，高声朝郁红和思羽道，“回阵里去！”
en_us: Indeed, after about 30 seconds, one of the cultivators summoned a rain of swords which filled the entire sky. The swords flew down toward Feng Ying and the girls. Feng Ying had no choice but to retreat. As he ran toward the other girls, he turned to shout at Yu Hong and Si Yu, "Go back into the array!"

source: 果然，他眼神刷的一下亮了，闪得跟天上的星星似的，“真的？！”
en_us: Indeed, his gaze immediately brightened up like the stars in the sky. "Really?!"

source: 果然，奚秋有些激动，旁边的持法堂主奚辰却先一步急声问道，“一个月前，万魔窟现世之事，可是你所为？”
en_us: Sure enough, Xi Qiu was a little excited, but before he could speak, the Hall Master next to him asked urgently, "A month ago, the Myriad Fiend Den was resurrected; was it your doing?"

source: 枫影一惊，十五个化神修士，这郁家家主是想屠无敌派满门吗？
en_us: Feng Ying was shocked; fifteen Soul Formation cultivators, was this Yu Family intending to annihilate the Invincible Sect?

source: 枫影一惊，心下猛的一沉，“你……你没事吧？咦，等等……你要干嘛？”
en_us: Feng Ying's heart was in his mouth. "You... Are are you okay? Hey, wait... what are you doing?"

source: 枫影不是大意的人，敢公然怼上郁家的无敌掌门，修为肯定不弱。他找无敌派确实也是凭着一时之气，但既然他敢一个人来，自然就已经做好了充足的准备。只是元婴修为又如何，有了系统这个底牌，他绝对能赢，况且这又不是他第一次正面对抗化神修士。
en_us: Feng Ying was not a careless person, his cultivation must not be weak to have the guts to go up directly against the Invincible Sect's Sect Master. He did went to Invincible Sect in the heat of the moment, but since he dared to come alone, he had already done sufficient preparation. So what if she had Nascent Soul cultivation, with system as his trump card, he would definitely win. Moreover this was not his first time going against a Soul Formation cultivator directly.

source: 枫影僵了一下，似是没想到她回得这么干脆，“那你最好从现在开始，好好记住这个名字。”他越说越气，一字一句的道，“我是追魂楼楼主枫影，来此是为了三日前那件事讨个说法。”
en_us: Feng Ying froze for a moment, as if not expecting her to respond so directly, "Then you better remember this name from now on." The more he spoke, the angrier he grew, as he pronounced every word clearly, "I am the Soul Chasing Tower's Tower Master Feng Ying, I am here to get an explanation for the matter that happened three days ago."

source: 枫影几乎让系统把潜能全激出来，强行把修行暂时提到了化神后期，系统能调出来的帮助全都用上了，却也只能拖住七八个人的脚步。一边还要顺手照顾一下旁边的郁红和思羽，根本撑不了多久。
en_us: Feng Ying allowed the system to exert its full potential and forcefully increased his cultivation level to the late stage of Soul Formation. The system activated all the support it could offer, yet it was only just enough to delay seven to eight cultivators - and Feng Ying still had to support Yu Hong and Si Yu. He could not hang on for much longer.

source: 枫影又气又急，偏偏他一边要对付化神修士，一边还要护住后面更小的，根本抽不开身。
en_us: Feng Ying was both angry and anxious. Not only did he have to tackle the Soul Formation cultivators, he also had to protect the younger ones behind him. He couldn't afford to protect Si Yu and Yu Hong as well.

source: 枫影嘴角一抽，尽量忽略脑海里的系统音继续道，“据郁家的古籍记载，这个塔是千万年前郁家老祖飞升前的法器，里面是一处试练之地，内通仙界，只要能登上三层塔顶，就可以直接飞升成仙，所以才叫升仙塔。”
en_us: Feng Ying's mouth twitched. He tried to ignore the system and continued, "According to the Yu Family's ancient texts, the Pagoda is a Dharma artifact ccreated by its ancestors before they achieved Immortal Ascension millions of years ago. There are plenty of training grounds inside the pagoda which links to the Immortal World. If you make it to the third level of the pagoda, you would be able to achieve Immortal Ascension. That's why it's called the Immortal Ascension Pagoda."

source: 枫影嘴角一抽，所以她把他绑上来的重点在这里吗？谁稀罕你的萝卜地了！
en_us: Feng Ying's mouth twitched. Was this the reason she captrued him? Who cares about your radish land!

source: 枫影整个人都惊呆了，张嘴看着对面的人半天都没回神，系统可是他最大的底牌，就这么……被知道了……知道了……道了……了……
en_us: Feng Ying was stunned, he looked at the person with his mouth agape and could not elicit a response. The system was his greatest trump card, and it was so easily... made known... known...

source: 枫影显然不信，一脸怒气的看向沈萤道，“今日我倒霉，才会栽在你们手里。要杀要剐随便，但你砸了我追魂楼的事，我是不会就此罢手的。”
en_us: Feng Ying couldn't believe his ears. He turned to Shen Ying angrily and said, "I'm unlucky today to end up in your hands. Kill me if you want to, otherwise I will not let you off for destroying my Soul Chasing Tower."

source: 枫影暗骂了一声，连忙联系神识：“系统，潜能激发！”
en_us: Cursing silently, Feng Ying quickly contacted his Divine Perception: "System, activate potential!"
